Revit 2027 API
ParameterTypeId.RoofConstraintLevelParam Property
 "Reference Level"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RoofConstraintLevelParam { get; }
Public Shared ReadOnly Property RoofConstraintLevelParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RoofConstraintLevelParam {
	ForgeTypeId^ get ();
}
static member RoofConstraintLevelParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace